tutorials/solidMechanics/immersedTauFastenerElasticSolidFoam/demoTauFastener2/0/org/pFastener
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      pFastener;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;
boundaryField
{
    defaultFaces
    {
        type            empty;
    }
    inlet
    {
        type            zeroGradient;
    }
    defaultName
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 1e-05;
    }
    backFace
    {
        type            zeroGradient;
    }  

}


// ************************************************************************* //
